from flask import Flask, render_template, request

app = Flask(__name__)

def questions_data():
    questions = {
        "الاسم":[],
        "السن":[],
        "(BMI)معدل الوزن مقارنة بالطول":[],
        'هل يوجد أمراض؟': ['حمل', 'رضاعة', 'أمراض مزمنة', 'لا يوجد'],
        "معدل الحرق":[],
        "عايزة تتخني ولا تخسي؟": ['اتخن', 'اخس','احافظ على وزني'],
        "مشكلة الشعر":["تقصف ونعومة","انبات","مشكلتين معا","لا يوجد مشاكل"],
        "مشكلة الوجه":["هالات","حبوب","تصبغات وندبات","لا يوجد"],
        "مشكلة المناطق الحساسة":["غمقان","شعر تحت الجلد","لا يوجد"],
        "مشكلة المناطق الغير حساسة":["غمقان","جلد وزة","تشققات","لا يوجد"],
        "مشاكل اخرى":["رموش","حواجب","شفايف","اسنان",'لا يوجد']
    }
    return questions

@app.route('/')
def survey():
    questions = questions_data()
    return render_template('index.html',questions=questions)

@app.route('/submit', methods=["Get",'post'])
#@app.route("/result ", methods= ["Get","Post"])
def result():
    questions=questions_data()
    data= request.form.to_dict("utf-8")

    inbat = """ حل مشكلة الانبات عندنا وهي استخدام تركيبة غنية بالفيتامينات الفعالة في النبات الشعر مرة اخري وفيتامينات مثل الاوميجا ثري والجينكوبيلوبا والقيام بالتحاليل المناسبة كالسيوم وهيموجلوبين المخزون حديد"""
    tqasof=""" التقصف مشكلة بتضايق ناس كتيرة وصيدليات العقبي وفرتلك الحل وهو استخدام حمام كريم للترطيب وفرد الكوسر وشامبو غني بالارجانوالجوجوبا وكريم للترطيب والتثقيف وعلاج التقصيف"""
    inbat_tqasof=""" حل مشكلة الانبات عندنا وهي استخدام تركيبة غنية بالفيتامينات الفعالة في النبات الشعر مرة اخري وفيتامينات مثل الاوميجا ثري والجينكوبيلوبا والقيام بالتحاليل المناسبة كالسيوم وهيموجلوبين مخزون الحديد

     .... والتقصف مشكلة بتضايق ناس كتيرة وصيدليات العقبي وفرتلك الحل وهو استخدام حمام كريم للترطيب وفرد الكوسر وشامبو غني بالارجانوالجوجوبا وكريم للترطيب والتثقيف وعلاج التقصيف
    """

    halat="علاج الهالات السوداء عبارة عن كريم للترطيب وتفتيح تحت العين وجهاز مساج لزيادة الدورة الدموية تحت العين مع هياليورونيك اسيد لزيادة الحضارة ومنع التجاعيد مع تقليل المنبهات والنوم ثمان ساعات وزيادة شرب المياه"
    hobob= "الحبوب مشكلة بتقلل من جمال البشرة وعندنا هنخلي بشرتك اجمل بكتير و نزود ثقتك بنفسك و العلاج عبارة عن استخدام مضادات للبكتيريا والالتهابات وتفتيح وندبات الحبوب بمنتجات طبيعية ومنع الكيماويات واستخدام ماسك لتصنيف المسام وقفلها وإزالة البثور"
    nadabat="بعد ما بنتخلص من اي حبوب في بشرتنا بيفضل فيها ندبات و تصبغات بتقلل من جمال مظهرها .. صيدليات العقبي بتوفرلك كريمات طبيعية لتفتيح التصبغات وندبات وماسك لقفل المسام وإزالة البثور"

    ghamaqan_1="غمقان المناطق الحساسه بيقلل من ثقتك بنفسك بس صيدليات العقبي هتساعدك تزودي ثقتك بنفسك تاني و موفرالك كريمات طبيعية لتفتيح وافزاز الكولاجين الطبيعي وتقليل إفراز الميلانين وتصنيف المسام وتقليل ريحة العرق"
    shaar_t7t_elgeld_1="الشعر تحت الجلد بيأثر على مظهر البشرة و ملمسها و احيانا بيسبب حبوب والتهابات .. صيدليات العقبي بتوفرلك منتجات طبيعية لإزالة الشعر تحت الجلد مع تنعيم المنطقة وتقليل ريحة العرق"

    ghamaqan_2="لمشاكل المناطق الغير حساسة صيدليات العقبي بتوفر منتجات طبيعية لتفتيح وتنعيم وتقليل التصبغات وإزالة الشعر تحت الجلدوالجلد الميت"

    romosh="استخدام سيرم طبيعي لزيادة انبات الرموش وتطويرها وتكثيفا"
    hawageb="استخدام سيرم طبيعي لزيادة انبات الحواجب وتطويرها وتكثيفها"
    shafayef="استخدام منتجات طبيعية لإزالة الجلد الميت والتأييد والتنعيم"
    asnan="إزالة الجير بمواد طبيعية للحفاظ علي مينة الأسنان من التآكل"

    opposite_data= {
        "عايزة تتخني ولا تخسي؟": ['اجابتك كانت اتخن وصيدليات العقبي تقدر توفرلك مجموعة علاج النحافة خالية تماما من الكورتيزون و اي مواد ضرة لصحتك و غنية بالفيتامينات والبروتينات اللي بتعوض نقصهم في جسمك و بتساعدك تبنيه صح ... هنا هنساعدك تزودي وزنك و كمان تزودي ثقتك بنفسك', 'اجابتك كانت اخس وعلشان صحتك ونفسيتك كمان تهمنا صيدليات العقبي عملتلك تركيبة تخسيس جبارة تسد النفس و تزود الحرق وكمان بنخلي دكتور يتابع معاكي و يعملك نظام غذائي مخصوص علشانك لحد ما نوصل للجسم المثالي ليكي وكمان وفرنالك سكر ميغيرش طعم المشروبات و مفيهوش سعرات حرارية',' '],
        "مشكلة الشعر":[tqasof,inbat,inbat_tqasof," "],
        "مشكلة الوجه":[halat,hobob,nadabat," "],
        "مشكلة المناطق الحساسة":[ghamaqan_1,shaar_t7t_elgeld_1," "],
        "مشكلة المناطق الغير حساسة":[ghamaqan_2,ghamaqan_2,ghamaqan_2," "],
        "مشاكل اخرى":[romosh,hawageb,shafayef,asnan,' ']
    }

    dict_rate={
        "عايزة تتخني ولا تخسي؟": [-1,-1,0],
        "مشكلة الشعر":[-1,-1,-2,0],
        "مشكلة الوجه":[-1,-1,-1,0],
        "مشكلة المناطق الحساسة":[-1,-1,0],
        "مشكلة المناطق الغير حساسة":[-1,-1,-1,0],
        "مشاكل اخرى":[-1,-1,-1,-1,0]
    }

    rate=15
    
    for question , answer in data.items():
        if question in opposite_data.keys():

            indx=questions[question].index(answer)
            data[question]= opposite_data[question][indx]
            rate=rate+dict_rate[question][indx]


    return render_template("result.html", questions=data,rate=rate)

if __name__ == '__main__':
    app.run(debug=True, port=9000)


